<a href="https://colab.research.google.com/github/oyuka1112/oyuka1112/blob/main/Untitled4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**A new insurance company opened in Maryland and sent promotional mail pieces to 500 contacts**
- 200 Contacts – Person that the promotion was mailed to
- 300 Mail pieces – Item that was sent in the mail
- 200 Responses – Number of contacts responded to a mail piece
- 50 Conversions – Number of contacts that responded to a mail piece and purchased insurance

***Limitations***
- A contact can only respond to mail that was sent to them, but multiple mail pieces can be sent to 1 contact. Contact information is stored in data frame 
*df_contacts*
-	Each mail piece can only be sent to 1 contact but is not guaranteed to have a response. Mail information is stored in data frame *df_mail*
-	Each mail piece can only have 1 response but is not guaranteed. Response information is stored in data frame *df_responses*
-	After the contact responds, if they want the insurance, they will convert their quote and make an actual purchase. This information is stored in data frame *df_conversions*

**Import all the libraries**

In [36]:
import pandas as pd
from datetime import datetime
import calendar

**Import and read all the files**

In [13]:
contacts = pd.read_excel(r'Df_contacts.txt.xlsx')  
mails= pd.read_excel(r'Df_mails.xlsx')  
responses= pd.read_excel(r'Df_responses.xlsx')  
conversions= pd.read_excel(r'Df_conversion.xlsx')

**Familiarize with each datasets**

In [ ]:
# pd.set_option("display.max_rows", None, "display.max_columns", None) #to see the full datasets

In [14]:
contacts

     CONT_ID                NAME         CITY STATE   ZIP5
0          1         GINA LAPONE       DALLAS    TX  98004
1          2         JAMES PAPIA  MIAMI BEACH    NY  39773
2          3  LAURIN H TEMPLETON       BOSTON    NJ  84404
3          4        PAUL SWEEZER    LAS VEGAS    NM  46723
4          5          A NAGAMINE  SAINT LOUIS    MO  28356
..       ...                 ...          ...   ...    ...
195      196        SHAWN LITTLE   MOORESTOWN    NY  85268
196      197        ALBIN NELSON   ORANGEBURG    IA  93704
197      198        STEVE GOEREE    SOUTHLAKE    AL  50125
198      199         JOAN BURILL     CARLSBAD    FL  21401
199      200        JOHN MCNULTY         LULA    FL  77338

[200 rows x 5 columns]

In [15]:
mails

     MAIL_ID  CONT_ID  MAIL_MONTH  MAIL_DATE
0          1       35           6 2016-06-12
1          2       50          10 2017-10-27
2          3      148          11 2017-11-21
3          4      121           3 2018-03-16
4          5       28           5 2015-05-22
..       ...      ...         ...        ...
295      296        4          10 2015-10-23
296      297       41           5 2017-05-14
297      298       49          12 2016-12-16
298      299      120           7 2018-07-21
299      300      150          12 2018-12-22

[300 rows x 4 columns]

In [16]:
responses

     RESPONSE_ID  MAIL_ID  RESP_DATE
0              1       10 2019-12-10
1              2      205 2019-01-04
2              3      176 2019-03-21
3              4      166 2019-04-21
4              5      160 2019-12-13
..           ...      ...        ...
195          196      234 2019-04-22
196          197      272 2019-03-18
197          198       18 2019-12-18
198          199      198 2019-12-17
199          200       47 2019-03-18

[200 rows x 3 columns]

In [19]:
conversions.tail()

    CONV_ID  RESPONSE_ID  CONV_DATE
45       46          170 2020-06-01
46       47           24 2020-11-08
47       48           78 2020-07-24
48       49          182 2020-03-03
49       50           43 2020-12-26

- 	**Write python code that will produce a data frame that contains the contact name, mail date and conversion date of all contacts have converted their insurance policy**
-  a.	You can assume that all ID columns above are integers
-  b.	When available, please specify the join type. Do not rely on defaults

In [27]:
df1 = pd.merge(conversions, responses  , on=['RESPONSE_ID'], how='inner').sort_values('RESPONSE_ID') #merge conversions and responses datasets, no duplicates on each
no_dup_mails = mails.drop_duplicates(subset =['CONT_ID'], keep = 'first')  #drop the duplicated responses from a same contact id
df2 = pd.merge(df1, no_dup_mails  , on=['MAIL_ID'], how='inner').sort_values('MAIL_ID')  #merge the previous one with mails with no duplication
df3 = pd.merge(df2, contacts  , on=['CONT_ID'], how='inner').sort_values("CONT_ID").sort_index() #merge the previous one with contacts
df3 = df3[['NAME', 'MAIL_DATE', 'CONV_DATE']]
#df3 is the data frame that contains the contact name, mail date and conversion date of all contacts have converted their insurance policy

- **Write python code that will give us the percentage of response per city**

In [35]:
#First merge the responses dataset to contacts, so that we can look at the cities where responses came from.
no_dup_mails = mails.drop_duplicates(subset =['CONT_ID'], keep = 'first')  #drop the duplicated responses from a same contact id
dff1 = pd.merge(responses, no_dup_mails  , on=['MAIL_ID'], how='inner')  #merge responses one with mails with no duplication
dff2 = pd.merge(dff1, contacts  , on=['CONT_ID'], how='inner').sort_values("CONT_ID").sort_index()
dff2[['CITY']].nunique() #check unique values in city column
#Found that some cities have same name but different state
#Join the city and state 
dff2['CITY_STATE'] = dff2[['CITY', 'STATE']].agg(', '.join, axis=1)
series=(dff2['CITY_STATE'].value_counts()/dff2['CITY_STATE'].count())*100       #Found the percentile of each cities response
series1 = series.to_frame()    #Set it to dataframe
series1=series1.reset_index().rename(columns ={'index':'CITY_STATE', 'CITY_STATE':'PERCENTAGE'})  #Reset the index for clarification
series1["PERCENTAGE"] = (series1.PERCENTAGE).apply(lambda x: round(x,2))  #Round the percentile for 2 decimals
series1

          CITY_STATE  PERCENTAGE
0      LAFAYETTE, KY        0.76
1       LAKEWOOD, AR        0.76
2    COFFEYVILLE, ID        0.76
3       NEW BERN, MD        0.76
4      CHARLOTTE, MD        0.76
..               ...         ...
127  MIAMI BEACH, NY        0.76
128   FORT WORTH, FL        0.76
129   BOCA RATON, FL        0.76
130   GREENVILLE, SD        0.76
131        TAMPA, VA        0.76

[132 rows x 2 columns]

- **Write python code that will give us the response time for each mail piece that has been responded to.**

In [62]:
res_m = pd.merge(mails, responses , on=['MAIL_ID'], how='inner').sort_values('RESPONSE_ID')  #merge the 
res_m['TIME_DIF_YEAR'] = ((pd.to_datetime(res_m['RESP_DATE']) - pd.to_datetime(res_m['MAIL_DATE'])).dt.total_seconds() / 60 /60 /24 /365)   #convert the time difference to year
res_m['TIME_DIF_YEAR'] = (res_m.TIME_DIF_YEAR).apply(lambda x: round(x,2))     #round it to 2 decimals
res_m.head()

     MAIL_ID  CONT_ID  MAIL_MONTH  ... RESPONSE_ID  RESP_DATE  TIME_DIF_YEAR
5         10      192           8  ...           1 2019-12-10           3.29
132      205      132          11  ...           2 2019-01-04           3.17
111      176      112           8  ...           3 2019-03-21           3.62
105      166      160           7  ...           4 2019-04-21           3.77
100      160       63          10  ...           5 2019-12-13           2.15

[5 rows x 8 columns]

- **Write python code that will tell us which mail month got the most responses.**

In [42]:
resp_date = responses['RESP_DATE'].groupby(responses.RESP_DATE.dt.month).agg('count')  #Group the months and count how many
resp_date.idxmax()  #Find the maximum month number
calendar.month_name[resp_date.idxmax()]  #convert it to verbose month if needed

'April'

- **Write python code that will tell us which mail month got the most conversions.**

In [43]:
df_con = conversions['CONV_DATE'].groupby(conversions.CONV_DATE.dt.month).agg('count')
df_con.idxmax() #Find the maximum month number
calendar.month_name[df_con.idxmax()] #convert it to month

'May'

- **Given that MAIL_MONTH 1 = January 2 = February, … 12 = December, create a new column in df_mail that will give us the verbose mail month**

In [44]:
mails['VERBOSE_MAIL_MONTH'] = mails['MAIL_MONTH'].apply(lambda x: calendar.month_abbr[x])

- **Write python code that will create the FIRST_NAME and LAST_NAME column from the value found in the NAME column.**
- a.	Assume that the NAME column is [FIRST_NAME] [LAST_NAME] separated with a space
- b.	Assume every NAME contains first and last name. Invalid names have already been filtered out

In [56]:
names = contacts['NAME'].to_frame() #Get names from contacts
names = names['NAME'].str.split(',', expand = True).add_prefix('NAME')  #Split it with ',' 
names1 = names['NAME0'].str.split(',', expand = True).add_prefix('NAME')  #If there is MD, PhD, that will be in 'NAME1' column, the full name will bi in 'NAME0'
contacts['FIRST NAME'] = names1['NAME0'].str.split().str[0].astype(str, errors='ignore')  #Fisrt name
contacts['LAST NAME'] = names1['NAME0'].str.split().str[-1].astype(str, errors='ignore')  #There is last name that PAUL-JOHN etc.,
contacts['LAST NAME'] = contacts['LAST NAME'].str.split('-').str[-1].astype(str, errors='ignore')  #replace it with the name after '-' 
contacts

     CONT_ID                NAME         CITY  ...   ZIP5  FIRST NAME  LAST NAME
0          1         GINA LAPONE       DALLAS  ...  98004        GINA     LAPONE
1          2         JAMES PAPIA  MIAMI BEACH  ...  39773       JAMES      PAPIA
2          3  LAURIN H TEMPLETON       BOSTON  ...  84404      LAURIN  TEMPLETON
3          4        PAUL SWEEZER    LAS VEGAS  ...  46723        PAUL    SWEEZER
4          5          A NAGAMINE  SAINT LOUIS  ...  28356           A   NAGAMINE
..       ...                 ...          ...  ...    ...         ...        ...
195      196        SHAWN LITTLE   MOORESTOWN  ...  85268       SHAWN     LITTLE
196      197        ALBIN NELSON   ORANGEBURG  ...  93704       ALBIN     NELSON
197      198        STEVE GOEREE    SOUTHLAKE  ...  50125       STEVE     GOEREE
198      199         JOAN BURILL     CARLSBAD  ...  21401        JOAN     BURILL
199      200        JOHN MCNULTY         LULA  ...  77338        JOHN    MCNULTY

[200 rows x 7 columns]

- **Write python code that will create a new data frame that contains only contacts from Maryland**
- a.	The state column is the state abbreviation, not the state name. Maryland = MD

In [57]:
contacts.loc[contacts.STATE == 'MD']

     CONT_ID               NAME       CITY STATE   ZIP5 FIRST NAME  LAST NAME
57        58  JOE COVEY LANDERS  URBANDALE    MD  11801        JOE    LANDERS
120      121    ROBERT LUNDGREN    SHAWNEE    MD  23227     ROBERT   LUNDGREN
125      126  PATRICK STALLINGS  CHARLOTTE    MD   5476    PATRICK  STALLINGS
162      163      MICHAEL HOUCK  SOUTHAVEN    MD  11729    MICHAEL      HOUCK
164      165        JAMES HEITZ      JENKS    MD  93727      JAMES      HEITZ
184      185          JOE ALERS   NEW BERN    MD   3031        JOE      ALERS
185      186         USA PEGORS  EL DORADO    MD  97504        USA     PEGORS